Revit 2024 API
ParameterTypeId.CurtaingridUseCurveDistHoriz Property
 "Use Curve Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId CurtaingridUseCurveDistHoriz { get; }
Visual Basic
Public Shared ReadOnly Property CurtaingridUseCurveDistHoriz As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CurtaingridUseCurveDistHoriz {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace